trunk/JardenPOC/JohnWS/src/john/ws/SecretHelloRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			soapenv:mustUnderstand="1">
			<ns1:EncryptedKey Id="URSiM1HTbGcITada"
				xmlns:ns1="http://www.w3.org/2001/04/xmlenc#">
				<ns1:EncryptionMethod
					Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5" />
				<ns2:KeyInfo
					xmlns:ns2="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference
						wsu:Id="str_hR56R3KOK7U1SXE0"
						xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
						xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
						<ns2:X509Data>
							<ns2:X509IssuerSerial>
								<ns2:X509IssuerName>
									CN=CertGenCAB,OU=FOR TESTING
									ONLY,O=MyOrganization,L=MyTown,ST=MyState,C=US
								</ns2:X509IssuerName>
								<ns2:X509SerialNumber>
									71464022248173139074891891629523533659
								</ns2:X509SerialNumber>
							</ns2:X509IssuerSerial>
						</ns2:X509Data>
					</wsse:SecurityTokenReference>
				</ns2:KeyInfo>
				<ns1:CipherData>
					<ns1:CipherValue>
						CRDvRNebp+OzjWifjijtA6pIqVNiAqrIHc9oQYLLR80BqV/QzQGmNZ1cRyJ1++IW1kw412aVEJ3EIF+SvzgSvw==
					</ns1:CipherValue>
				</ns1:CipherData>
				<ns1:ReferenceList>
					<ns1:DataReference URI="#HkRIHCuV7UKycKO2" />
				</ns1:ReferenceList>
			</ns1:EncryptedKey>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<m:secretHello xmlns:m="http://john/ws">
			<m:name>
				<ns1:EncryptedData Id="HkRIHCuV7UKycKO2"
					Type="http://www.w3.org/2001/04/xmlenc#Content" MimeType="text/xml"
					Encoding="UTF-8" xmlns:ns1="http://www.w3.org/2001/04/xmlenc#">
					<ns1:EncryptionMethod
						Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc" />
					<ns1:CipherData>
						<ns1:CipherValue>
							YnE79xHb9ggqkbjxMnTsZHQ/Y73uVUqpWr1TQ1oxfJo=
						</ns1:CipherValue>
					</ns1:CipherData>
				</ns1:EncryptedData>
			</m:name>
		</m:secretHello>
	</soapenv:Body>
</soapenv:Envelope>